test/fixtures/stripe_events/customer.subscription.deleted.json

{
  "api_version": "2024-06-20",
  "created": 1728203229,
  "data": {
    "object": {
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false,
        "liability": null
      },
      "billing_cycle_anchor": 1728203226,
      "billing_cycle_anchor_config": null,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": 1728203229,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": "cancellation_requested"
      },
      "collection_method": "charge_automatically",
      "created": 1728203226,
      "currency": "usd",
      "current_period_end": 1730881626,
      "current_period_start": 1728203226,
      "customer": "cus_QynOslZSmXOcAQ",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "ended_at": 1728203229,
      "id": "sub_1Q6pnyHWdrSF9AyBO5l15rNi",
      "invoice_settings": {
        "account_tax_ids": null,
        "issuer": {
          "type": "self"
        }
      },
      "items": {
        "data": [
          {
            "billing_thresholds": null,
            "created": 1728203226,
            "discounts": [],
            "id": "si_QynOVz1KsIixvl",
            "metadata": {},
            "object": "subscription_item",
            "plan": {
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1728203225,
              "currency": "usd",
              "id": "price_1Q6pnxHWdrSF9AyB6a3jxjOV",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "meter": null,
              "nickname": null,
              "object": "plan",
              "product": "prod_QynOECagWrjPT0",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1728203225,
              "currency": "usd",
              "custom_unit_amount": null,
              "id": "price_1Q6pnxHWdrSF9AyB6a3jxjOV",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "object": "price",
              "product": "prod_QynOECagWrjPT0",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "quantity": 1,
            "subscription": "sub_1Q6pnyHWdrSF9AyBO5l15rNi",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1Q6pnyHWdrSF9AyBO5l15rNi"
      },
      "latest_invoice": "in_1Q6pnyHWdrSF9AyBBaynIG5k",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "object": "subscription",
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "active": true,
        "aggregate_usage": null,
        "amount": 1500,
        "amount_decimal": "1500",
        "billing_scheme": "per_unit",
        "created": 1728203225,
        "currency": "usd",
        "id": "price_1Q6pnxHWdrSF9AyB6a3jxjOV",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "meter": null,
        "nickname": null,
        "object": "plan",
        "product": "prod_QynOECagWrjPT0",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1728203226,
      "status": "canceled",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": null
    }
  },
  "id": "evt_1Q6po1HWdrSF9AyBw4YcNNwS",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 2,
  "request": {
    "id": "req_OYIo5ztl1oKj9z",
    "idempotency_key": null
  },
  "type": "customer.subscription.deleted"
}
